import React, { Component } from 'react'
import {WingBlank } from 'antd-mobile'
export default class Useragreements extends Component {
  render() {
    return (
      <div>
    <h4 style={{background:"#e94747",height:"3rem",margin:0, lineHeight:"3rem",textAlign:'center',color:"#fff"}}>sky房产App用户协议及产品说明</h4>
      <WingBlank size="lg">
<p>如果您对本协议的任何条款表示异议，您可以选择不下载、安装、注册、登录、使用（以下统称“使用”）sky房产为您提供的任何软件或服务。无论您以何种方式使用sky房产提供的任何软件服务，即视为您已充分理解本协议并承诺作为本协议的一方当事人完全接受本协议包括隐私权政策在内的全部条款。</p>
<h5>一、本协议适用范围</h5>
<p>
1.1 本协议是您与sky房产（上海）文化传播股份有限公司及提供的相关服务可能存在的运营关联单位（下称“sky房产”）之间关于您使用sky房产相关软件或服务所订立的协议。“用户”或“您”均指sky房产相关服务的使用人。
1.2 本协议项下的“sky房产相关软件或服务”是指sky房产向用户提供的包括但不限于网络媒体、社区互动、互联网增值、互动娱乐、电子商务和广告等产品、软件及服务。
1.3 您在使用sky房产某一特定软件或服务时，该服务可能会另有已经发布或后续可能不断发布的单独的协议、相关业务规则等（以下统称为“单独协议或规则”）。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。您对前述任何业务规则、单独协议的接受，即视为您对本协议全部的接受。</p>
<h5>二、服务说明：</h5>
<p>
2.1 sky房产向您提供包括但不限于如下软件或服务：
- sky房产网（域名：hupu.com）及其他由sky房产运营的任何网站；

- sky房产直接拥有或运营的包括但不限于PC、平板、手机等全部终端客户端产品，如sky房产体育App等；

- sky房产直接拥有或运营的服务器、网络存储空间；

- sky房产提供给您的其他软件、技术或服务。

2.2 您使用sky房产相关软件或服务，可以通过预装、sky房产内下载、sky房产已授权的第三方下载等方式获取相关客户端或访问sky房产网。若您并非从前述途径，而是通过其他任何途径、渠道、方式获取sky房产软件或服务的（包括但不限于帐号、sky房产币、客户端下载等）均为非法行为，sky房产概不承认其效力，一经发现，sky房产有权立即作出删除、清零、封号等处理，任何因此导致的一切不利后果均由您自行承担。
2.3 sky房产可能为不同的终端设备开发了不同的应用程序软件版本，您应当根据实际设备状况获取、下载、安装合适的版本。为更好的提升用户体验及服务，sky房产将不时提供软件更新或改变（包括但不限于软件修改、升级、功能强化、开发新服务、软件替换等），sky房产将以包括但不限于系统提示、公告、站内信等方式提示您更新、下载或使用，您有权选择接受更新版本或服务，如果您不同意或者不接受sky房产相关软件或服务的改变，请直接拒绝、停止、取消使用行为，否则视为您同意并接受改变，同时该同意并接受的行为仍受本协议约束。
2.4 您仅可以合法使用sky房产相关软件或服务为目的或方式而使用sky房产相关软件或服务，除非得到sky房产明示事先书面授权，否则，您不得以任何形式改编、复制、传播、垂直搜索、镜像或交易sky房产相关软件或服务。sky房产许可您个人的、不可转让的、非独占地和非商业的合法使用sky房产相关软件或服务的权利。本协议未明示授权的其他一切权利仍由sky房产保留，您在行使该些权利时须另行获得sky房产的书面许可，同时sky房产如未行使前述任何权利，并不构成对该权利的放弃。</p>
<h5>三、用户注册及帐号：</h5>
<p>3.1 您无需注册即可开始使用sky房产相关软件或服务。同时，您也理解，为使您更好地使用sky房产相关软件或服务，保障您的帐号安全，某些功能和/或某些单项服务项目，要求您按照国家相关法律法规的规定，提供真实的身份信息实名注册并登陆后方可使用。
3.2 您理解并承诺，您所设置的帐号不得违反国家法律法规及sky房产的相关规则，您的帐户名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人或机构的姓名、名称、字号、头像等足以让人引起混淆的方式）开设帐号，不得恶意注册sky房产帐号（包括但不限于频繁注册、批量注册帐号等行为）。您在帐户注册及使用过程中需遵守法律法规、社会主义制度、国家利益、公民合法权益、社会公共秩序、道德风尚及信息真实性等“七条底线”要求。
3.3 您在sky房产的注册帐号所有权及有关权益均归sky房产所有，您完成注册手续后仅享有该帐号的使用权。您的帐号仅限于您本人使用，未经sky房产书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该帐号。如果sky房产发现或者有合理理由认为使用者并非帐号初始注册人，sky房产有权在未通知您的情况下，暂停或终止向该注册帐号提供服务，并有权注销该帐号，而无需向注册该帐号的用户承担法律责任。
3.4 您有责任维护个人帐号、密码的安全性与保密性，并对您以注册帐号名义所从事的活动承担全部法律责任，包括但不限于数据的修改、发表的言论以及其他在sky房产的操作行为。
3.5 在注册、使用和管理帐号时，您应保证注册帐号时填写的身份信息的真实性，请您在注册、管理帐号时使用真实、准确、合法、有效的相关身份证明材料及必要信息（包括您的姓名及电子邮件地址、联系电话、联系地址等），若国家法律法规有特殊规定，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，以便sky房产在必要时与您联系或为您提供更好的服务，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确、不真实、不合法或者sky房产有理由怀疑为错误、不实或不合法的资料，则您可能无法使用sky房产相关软件或服务，或在使用过程中部分功能受到限制。
3.6 为了更好的为您提供服务以及确保您的帐户安全，您同意并授权：sky房产可以根据您提供的手机号码、身份证号码等信息，向全国公民身份号码查询服务中心、电信运营商、金融服务机构等机构或单位发起用户身份真实性、用户征信记录、用户手机号码有效性状态等情况的查询。</p>
<h5>四、用户个人信息保护：</h5>
<p>4.1 sky房产与用户一同致力于用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，保护用户个人信息是sky房产的基本原则之一。除非法律法规及本协议另有规定，否则未经用户同意，sky房产不会向sky房产以外的任何公司、组织和个人披露您的个人信息。
4.2 sky房产将在sky房产相关软件或服务中使用相应的安全技术及其他安全措施并建立完善的管理制度来保护您的个人信息。
4.3 用户在注册帐号或使用sky房产过程中，需要提供一些必要信息，包括但不限于有效的身份证明材料及相关必要信息（包括但不限于您的姓名、电子邮件地址、联系电话、联系地址等）。若您填写的信息不完整，则无法使用sky房产相关软件或服务，或在使用过程中受到限制。
4.4 您理解并同意出于安全性和身份识别（如帐号或密码找回申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
4.5 sky房产不会将用户个人信息转移或披露给任何非关联的第三方，除非有如下情形之一或更多：
4.5.1 相关法律法规或司法、行政等国家机关要求；
4.5.2 为完成合并、分立、收购或资产转让而转移；
4.5.3 获得用户或未成年用户监护人的授权；
4.5.4 为维护sky房产自身合法权益而向用户提起诉讼或仲裁；
4.5.5 sky房产及其关联公司为提供您要求的服务所必需；
4.5.6 其他合理情形。
4.6 请您注意勿在使用sky房产及相关服务中透露自己的各类财产账户/帐户、银行卡、信用卡、第三方支付账户及对应密码等自认为隐私的重要信息或重要资料，否则由此带来的任何损失由您自行承担。</p>
  

</WingBlank>


      </div>
    )
  }
}
